---
kind: enumMember
id: F:Autodesk.Revit.DB.ModifierType.ViewType
enum: Autodesk.Revit.DB.ModifierType
source: html/14da29ca-e466-9c3f-7a5b-5988a0e0ef6b.htm
---
# Autodesk.Revit.DB.ModifierType.ViewType

Signals that the view type will appear in the layer name.